test/site/content-org/all-posts.org
#+hugo_base_dir: ../

#+seq_todo: TODO DRAFT DONE
#+seq_todo: TEST__TODO | TEST__DONE

#+property: header-args :eval no

#+startup: indent

#+macro: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]
#+macro: oxhugoissue =ox-hugo= Issue #[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]
#+macro: hugoissue =hugo= Issue #[[https://github.com/gohugoio/hugo/issues/$1][$1]]
#+macro: hugopr =hugo= PR #[[https://github.com/gohugoio/hugo/pull/$1][$1]]
#+macro: bfissue /Blackfriday/ Issue #[[https://github.com/russross/blackfriday/issues/$1][$1]]
#+macro: commit commit [[https://github.com/kaushalmodi/ox-hugo/commit/$1][$1]]

# https://scripter.co/latex-in-html/
#+macro: latex @@html:<span class="latex">L<sup>a</sup>T<sub>e</sub>X</span>@@

#+author:

** External Links                                            :external_links:
:PROPERTIES:
:EXPORT_FILE_NAME: external-links
:EXPORT_OPTIONS: broken-links:t
:END:
- [[ftp://ftp.gnu.org/gnu/emacs/][Emacs download (FTP)]]
- [[https://orgmode.org][Org mode (HTTPS)]]
- [[http://some.insecure.site][Dummy http link]]
*** Gopher link support
{{{oxhugoissue(132)}}}
# - [[gopher://some.gopher.site][Dummy gopher link]]

The /gopher/ link support requires user to add something like this to
their user config:
#+begin_src emacs-lisp
(with-eval-after-load 'org
  (defun org-link-gopher-export-link (link desc format)
    "Create export version of LINK and DESC to FORMAT."
    (let ((link (concat "gopher:" link)))
      (cond
       ((eq format 'html)
        (format "<a href=\"%s\">%s</a>" link desc))
       ((eq format 'latex)
        (format "\\href{%s}{%s}" link desc))
       (t                               ;`ascii', `md', `hugo', etc.
        (format "[%s](%s)" desc link)))))
  (org-link-set-parameters "gopher" :export #'org-link-gopher-export-link))
#+end_src

Once that is evaluated, links like these will export fine i.e. no
"Unable to resolve link" errors:
#+begin_src org
[[gopher://some.gopher.site][Dummy gopher link]]
#+end_src
*** Mailto link support
{{{oxhugoissue(149)}}}

[[mailto:abc@xyz.com][My email]]
